Documents/ПоступлениеДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПоступлениеДС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БалансУченика</xr:Item>
				<xr:Item>AccumulationRegister.Налог</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ученик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ученики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПоступлениеДС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализировать данные документа.
// 
// Параметры:
//  ДокументПоступлениеДС - ДокументСсылка.ПоступлениеДС - Ссылка на документ "ПоступлениеДС"
//  СтруктураДополнительныеСвойства - Структура - дополнительные свойства
Процедура ИнициализироватьДанныеДокумента(ДокументПоступлениеДС, ДополнительныеСвойства) Экспорт  
	
	ТаблицаБалансУченика = ДанныеТаблицаБалансУченика(ДокументПоступлениеДС, ДополнительныеСвойства);
		
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаБалансУченика", ТаблицаБалансУченика);
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Функция ДанныеТаблицаБалансУченика(ДокументПоступлениеДС, СтруктураДополнительныеСвойства)  
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеДС.Ссылка КАК Ссылка,
	               |	ПоступлениеДС.Дата КАК Период,
	               |	ПоступлениеДС.Ученик КАК Ученик,
				   |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	               |	ПоступлениеДС.Сумма КАК Сумма
	               |ИЗ
	               |	Документ.ПоступлениеДС КАК ПоступлениеДС
	               |ГДЕ
	               |	ПоступлениеДС.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДокументПоступлениеДС);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	
	Возврат Выгрузка;
	
КонецФункции	

#КонецОбласти

#КонецЕсли
